
-- Console Port Security --

#login 

R1#conf t
R1(config)#line console 0
R1(config-line)#password ccna
R1(config-line)#login
R1(config-line)#end
R1#exit


#login local 

R1#conf t
R1(config)#username jeremy secret ccnp
R1(config)#line console 0
R1(config-line)#login local
R1(config-line)#end
R1#exit

line con 0
exec-timeout 3 30
password ccna
logging synchronous
login local



-- Management IP --

SW1(config)#interface vlan1
SW1(config-if)#ip address 192.168.1.253 255.255.255.0
SW1(config-if)#no shutdown
SW1(config-if)#exit
SW1(config)#ip default-gateway 192.168.1.254



-- Telnet --

SW1(config)#enable secret ccna
SW1(config)#username jeremy secret ccna
SW1(config)#access-list 1 permit host 192.168.2.1
SW1(config)#line vty 0 15
SW1(config-line)#login local
SW1(config-line)#exec-timeout 5 0
SW1(config-line)#transport input telnet
SW1(config-line)#access-class 1 in


transport input telnet allows only Telnet connections.
transport input ssh allows only SSH connections.
transport input telnet ssh allows both.
transport input all allows all connections.
transport input none allows no connections.

*access-class applies an ACL to the VTY lines,
ip access-group applies an ACL to an interface.


line vty 0 4
access-class 1 in
exec-timeout 5 0
login local
transport input telnet
line vty 5 15
access-class 1 in
exec-timeout 5 0
login local
transport input telnet


-- SSH (Secure Shell) --

#Check SSH Support

SW1#show version
Cisco IOS Software, vios_l2 Software (vios_l2-ADVENTERPRISEK9-M), Version 15.2(4.0.55)E, TEST
ENGINEERING ESTG_WEEKLY BUILD, synced to END_OF_FLO_ISP
Technical Support: http://www.cisco.com/techsupport
Copyright (c) 1986-2015 by Cisco Systems, Inc.
Compiled Tue 28-Jul-15 18:52 by sasyamal

SW1#show ip ssh
SSH Disabled - version 1.99
%Please create RSA keys to enable SSH (and of atleast 768 bits for SSH v2).
Authentication methods:publickey,keyboard-interactive,password
Authentication Publickey Algorithms:x509v3-ssh-rsa,ssh-rsa
Hostkey Algorithms:x509v3-ssh-rsa,ssh-rsa
Encryption Algorithms:aes128-ctr,aes192-ctr,aes256-ctr,aes128-cbc,3des-cbc,aes192-cbc,aes256-cbc
MAC Algorithms:hmac-sha1,hmac-sha1-96
Authentication timeout: 120 secs; Authentication retries: 3
Minimum expected Diffie Hellman key size : 1024 bits
IOS Keys in SECSH format(ssh-rsa, base64 encoded): NONE


- RSA Keys -

SW1(config)#ip domain name jeremysitlab.com

SW1(config)#crypto key generate rsa
The name for the keys will be: SW1.jeremysitlab.com
Choose the size of the key modulus in the range of 360 to 4096 for your
General Purpose Keys. Choosing a key modulus greater than 512 may take
a few minutes.
How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...
[OK] (elapsed time was 1 seconds)
SW1(config)#
*Feb 21 04:22:35.778: %SSH-5-ENABLED: SSH 1.99 has been enabled

SW1(config)#do show ip ssh
SSH Enabled - version 1.99
Authentication methods:publickey,keyboard-interactive,password
Encryption Algorithms:aes128-ctr,aes192-ctr,aes256-ctr,aes128-cbc,3des-cbc,aes192-cbc,aes256-cbc
MAC Algorithms:hmac-sha1,hmac-sha1-96
Authentication timeout: 120 secs; Authentication retries: 3
Minimum expected Diffie Hellman key size : 1024 bits
IOS Keys in SECSH format(ssh-rsa, base64 encoded): SW1.jeremysitlab.com
[output omitted]


#SSH Configuration: VTY Lines 

SW1(config)#enable secret ccna
SW1(config)#username jeremy secret ccna
SW1(config)#access-list 1 permit host 192.168.2.1
SW1(config)#ip ssh version 2
SW1(config)#line vty 0 15
SW1(config-line)#login local
SW1(config-line)#exec-timeout 5 0
SW1(config-line)#transport input ssh
SW1(config-line)#access-class 1 in


# SSH Configuration

1) Configure host name
2) Configure DNS domain name
3) Generate RSA key pair
4)Configure enable PW, username/PW
5) Enable SSHv2 (only)
6)Configure VTY lines

Connect: ssh -l username ip-address OR ssh username@ip-address


Router(config)#crypto key generate rsa
% Please define a hostname other than Router.
Router(config)#hostname R2
R2(config)#crypto key generate rsa
% Please define a domain-name first.
R2(config)#ip domain name jeremysitlab.com
R2(config)#crypto key generate rsa
The name for the keys will be: R2.jeremysitlab.com
[output omitted]

Connect: ssh -l username ip-address OR ssh username@ip-address


-- Command Summary --

SW1# show version
SW1# show ip ssh
SW1(config)# ip default-gateway ip-address
SW1(config)# line con 0
SW1(config)# line vty 0 15
SW1(config)# crypto key generate rsa
SW1(config)# ip ssh version 2
SW1(config-line)# login [local]
SW1(config-line)# transport input [protocols | all | none]
SW1(config-line)# exec-timeout minutes seconds
SW1(config-line)# access-class acl in

> telnet ip-address
> ssh -l username ip-address
> ssh username@ip-address


-- Allow only 192.168.1.1 to connect to R1 via SSH --

R1(config)#access-list 199 permit tcp host 192.168.1.1 any eq 22
R1(config)#line vty 0 15
R1(config-line)#access-class 199 in



-- Example Configuration --

SW2 has been newly added to the network, but has not yet been configured.

1. Connect Laptop1 to SW2's console port to perform the following configurations:

Host name: SW2
Enable secret: ccna
Username/PW: jeremy/ccna
VLAN1 SVI: [192.168.2.253/24](http://192.168.2.253/24)
Default gateway: R2

2. Configure the following console line security settings on SW2:

Authentication: Local user
Exec timeout: 5 minutes

3. Configure SW2 for remote access via SSH:

Domain name: [jeremysitlab.com](http://jeremysitlab.com/)
RSA key size: 2048 bits
Authentication: Local user
Exec timeout: 5 minutes
Protocols: SSH only
+Limit access to PC1 ONLY



#1
Switch>en 
Switch#conf t
Switch(config)#hostname SW2
SW2(config)#enable secret ccna
SW2(config)#username jeremy secret ccna
SW2(config)#interface vlan 1
SW2(config-if)#ip address 192.168.2.253 255.255.255.0
SW2(config-if)#no shutdown 
SW2(config-if)#exit
SW2(config)#ip default-gateway 192.168.2.254
SW2(config)#end
Switch#


#2
SW2(config)#
SW2(config)#line console 0
SW2(config-line)#login local 
SW2(config-line)#exec-timeout 5
SW2(config-line)#end
SW2#


#3
Press RETURN to get started!

User Access Verification

Username: jeremy
Password: 

SW2>en
Password: 

SW2#conf t
SW2(config)#crypto key generate rsa 
% Please define a domain-name first.


SW2(config)#ip domain-name jeremyitlab.com

SW2(config)#crypto key generate rsa 
The name for the keys will be: SW2.jeremyitlab.com
Choose the size of the key modulus in the range of 360 to 4096 for your
  General Purpose Keys. Choosing a key modulus greater than 512 may take
  a few minutes.

How many bits in the modulus [512]: 2048
% Generating 2048 bit RSA keys, keys will be non-exportable...[OK]


SW2(config)#access-list 1 permit host 192.168.1.1

SW2(config)#line vty 0 15
SW2(config-line)#login local 
SW2(config-line)#exec-timeout 5
SW2(config-line)#transport input ssh 
SW2(config-line)#access-class 1 in
SW2(config-line)#end
SW2#


- R2 -

R2#ping ip 192.168.2.253 

Type escape sequence to abort.
Sending 5, 100-byte ICMP Echos to 192.168.2.253, timeout is 2 seconds:
!!!!!
Success rate is 100 percent (5/5), round-trip min/avg/max = 0/0/0 ms

R2#ssh -l jeremy 192.168.2.253

% Connection refused by remote host
R2#


- PC1 -

C:\>ping 192.168.2.253

Pinging 192.168.2.253 with 32 bytes of data:

Reply from 192.168.2.253: bytes=32 time<1ms TTL=253
Reply from 192.168.2.253: bytes=32 time<1ms TTL=253
Reply from 192.168.2.253: bytes=32 time<1ms TTL=253
Reply from 192.168.2.253: bytes=32 time<1ms TTL=253

Ping statistics for 192.168.2.253:
    Packets: Sent = 4, Received = 4, Lost = 0 (0% loss),
Approximate round trip times in milli-seconds:
    Minimum = 0ms, Maximum = 0ms, Average = 0ms

C:\>

C:\>ssh -l jeremy 192.168.2.253

Password: 

SW2>

